chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Src/app_odometry.c
#include "app_odometry.h"

#include "bringup_log.h"
#include "chassis.h"
#include "motor_driver.h"
#include "stm32f4xx_hal.h"

#include <math.h>
#include <stdint.h>

/*
 * Initial measured/configurable odometry constants.
 * The encoder bring-up module used 65 mm wheels and 390 counts/rev defaults.
 * Update these after measuring one full wheel revolution and the actual track
 * width of the chassis.
 */
#ifndef WHEEL_DIAMETER_M
#define WHEEL_DIAMETER_M 0.065f
#endif

#ifndef WHEEL_BASE_M
#define WHEEL_BASE_M 0.150f
#endif

#ifndef ENCODER_TICKS_PER_REV
#define ENCODER_TICKS_PER_REV 390.0f
#endif

/*
 * Positive chassis forward command uses CHASSIS_LEFT_SIGN=-1 and
 * CHASSIS_RIGHT_SIGN=1 on the verified hardware. These macros convert raw
 * timer deltas into positive-forward wheel travel. If forward logs show one
 * side negative, flip that side here.
 */
#ifndef ODOM_LEFT_TICK_SIGN
#define ODOM_LEFT_TICK_SIGN CHASSIS_LEFT_SIGN
#endif

#ifndef ODOM_RIGHT_TICK_SIGN
#define ODOM_RIGHT_TICK_SIGN CHASSIS_RIGHT_SIGN
#endif

#define ODOM_LOG_INTERVAL_MS 200U
#define ODOM_PI 3.14159265358979323846f

static OdomPose_t odom_pose = {0.0f, 0.0f, 0.0f};
static OdomSample_t odom_last_sample = {0};
static int32_t odom_prev_left = 0;
static int32_t odom_prev_right = 0;
static float odom_log_delta_left_m = 0.0f;
static float odom_log_delta_right_m = 0.0f;
static uint32_t odom_last_log_ms = 0U;
static uint8_t odom_initialized = 0U;

static float Odom_TicksToMeters(int32_t ticks);
static float Odom_NormalizeAngle(float angle_rad);
static int32_t Odom_ScaleFloatRounded(float value, float multiplier);
static const char *Odom_FixedSign(int32_t value);
static uint32_t Odom_FixedWhole(int32_t value, int32_t decimal_scale);
static uint32_t Odom_FixedFraction(int32_t value, int32_t decimal_scale);
static void Odom_Log(uint32_t now_ms);

void Odom_Init(void)
{
    odom_prev_left = MotorDriver_GetEncoderA();
    odom_prev_right = MotorDriver_GetEncoderB();
    odom_pose.x_m = 0.0f;
    odom_pose.y_m = 0.0f;
    odom_pose.theta_rad = 0.0f;
    odom_last_sample.raw_left_delta = 0;
    odom_last_sample.raw_right_delta = 0;
    odom_last_sample.signed_left_delta = 0;
    odom_last_sample.signed_right_delta = 0;
    odom_last_sample.delta_left_m = 0.0f;
    odom_last_sample.delta_right_m = 0.0f;
    odom_last_sample.last_update_ms = HAL_GetTick();
    odom_log_delta_left_m = 0.0f;
    odom_log_delta_right_m = 0.0f;
    odom_last_log_ms = odom_last_sample.last_update_ms;
    odom_initialized = 1U;

    APP_LOG("[ODOM] init wheel_diam_mm=%lu wheel_base_mm=%lu ticks_per_rev=%lu left_sign=%d right_sign=%d",
            (unsigned long)Odom_FixedWhole(Odom_ScaleFloatRounded(WHEEL_DIAMETER_M, 1000.0f), 1),
            (unsigned long)Odom_FixedWhole(Odom_ScaleFloatRounded(WHEEL_BASE_M, 1000.0f), 1),
            (unsigned long)Odom_FixedWhole(Odom_ScaleFloatRounded(ENCODER_TICKS_PER_REV, 1.0f), 1),
            (int)ODOM_LEFT_TICK_SIGN,
            (int)ODOM_RIGHT_TICK_SIGN);
}

void Odom_Update(void)
{
    int32_t current_left;
    int32_t current_right;
    int32_t raw_left_delta;
    int32_t raw_right_delta;
    int32_t signed_left_delta;
    int32_t signed_right_delta;
    float dl;
    float dr;
    float dc;
    float dtheta;
    float theta_mid;
    uint32_t now_ms = HAL_GetTick();

    if (odom_initialized == 0U)
    {
        Odom_Init();
    }

    current_left = MotorDriver_GetEncoderA();
    current_right = MotorDriver_GetEncoderB();
    raw_left_delta = current_left - odom_prev_left;
    raw_right_delta = current_right - odom_prev_right;
    odom_prev_left = current_left;
    odom_prev_right = current_right;

    signed_left_delta = raw_left_delta * ODOM_LEFT_TICK_SIGN;
    signed_right_delta = raw_right_delta * ODOM_RIGHT_TICK_SIGN;
    dl = Odom_TicksToMeters(signed_left_delta);
    dr = Odom_TicksToMeters(signed_right_delta);
    dc = (dl + dr) * 0.5f;
    dtheta = (dr - dl) / WHEEL_BASE_M;
    theta_mid = odom_pose.theta_rad + (dtheta * 0.5f);

    odom_pose.x_m += dc * cosf(theta_mid);
    odom_pose.y_m += dc * sinf(theta_mid);
    odom_pose.theta_rad = Odom_NormalizeAngle(odom_pose.theta_rad + dtheta);

    odom_last_sample.raw_left_delta = raw_left_delta;
    odom_last_sample.raw_right_delta = raw_right_delta;
    odom_last_sample.signed_left_delta = signed_left_delta;
    odom_last_sample.signed_right_delta = signed_right_delta;
    odom_last_sample.delta_left_m = dl;
    odom_last_sample.delta_right_m = dr;
    odom_last_sample.last_update_ms = now_ms;

    odom_log_delta_left_m += dl;
    odom_log_delta_right_m += dr;

    if ((now_ms - odom_last_log_ms) >= ODOM_LOG_INTERVAL_MS)
    {
        Odom_Log(now_ms);
        odom_last_log_ms = now_ms;
        odom_log_delta_left_m = 0.0f;
        odom_log_delta_right_m = 0.0f;
    }
}

void Odom_Reset(void)
{
    odom_prev_left = MotorDriver_GetEncoderA();
    odom_prev_right = MotorDriver_GetEncoderB();
    odom_pose.x_m = 0.0f;
    odom_pose.y_m = 0.0f;
    odom_pose.theta_rad = 0.0f;
    odom_log_delta_left_m = 0.0f;
    odom_log_delta_right_m = 0.0f;
    odom_last_sample.raw_left_delta = 0;
    odom_last_sample.raw_right_delta = 0;
    odom_last_sample.signed_left_delta = 0;
    odom_last_sample.signed_right_delta = 0;
    odom_last_sample.delta_left_m = 0.0f;
    odom_last_sample.delta_right_m = 0.0f;
    odom_last_sample.last_update_ms = HAL_GetTick();
    odom_last_log_ms = odom_last_sample.last_update_ms;
    odom_initialized = 1U;

    APP_LOG("[ODOM] reset");
}

bool Odom_GetPose(OdomPose_t *pose)
{
    if ((pose == NULL) || (odom_initialized == 0U))
    {
        return false;
    }

    *pose = odom_pose;

    return true;
}

bool Odom_GetLastSample(OdomSample_t *sample)
{
    if ((sample == NULL) || (odom_initialized == 0U))
    {
        return false;
    }

    *sample = odom_last_sample;

    return true;
}

static float Odom_TicksToMeters(int32_t ticks)
{
    return ((float)ticks * (WHEEL_DIAMETER_M * ODOM_PI)) / ENCODER_TICKS_PER_REV;
}

static float Odom_NormalizeAngle(float angle_rad)
{
    while (angle_rad > ODOM_PI)
    {
        angle_rad -= (2.0f * ODOM_PI);
    }

    while (angle_rad < -ODOM_PI)
    {
        angle_rad += (2.0f * ODOM_PI);
    }

    return angle_rad;
}

static int32_t Odom_ScaleFloatRounded(float value, float multiplier)
{
    float scaled = value * multiplier;

    if (scaled < 0.0f)
    {
        return (int32_t)(scaled - 0.5f);
    }

    return (int32_t)(scaled + 0.5f);
}

static const char *Odom_FixedSign(int32_t value)
{
    return (value < 0) ? "-" : "";
}

static uint32_t Odom_FixedWhole(int32_t value, int32_t decimal_scale)
{
    int32_t abs_value = (value < 0) ? -value : value;

    return (uint32_t)(abs_value / decimal_scale);
}

static uint32_t Odom_FixedFraction(int32_t value, int32_t decimal_scale)
{
    int32_t abs_value = (value < 0) ? -value : value;

    return (uint32_t)(abs_value % decimal_scale);
}

static void Odom_Log(uint32_t now_ms)
{
    int32_t x_mm = Odom_ScaleFloatRounded(odom_pose.x_m, 1000.0f);
    int32_t y_mm = Odom_ScaleFloatRounded(odom_pose.y_m, 1000.0f);
    int32_t theta_tenth_deg = Odom_ScaleFloatRounded(odom_pose.theta_rad * 180.0f / ODOM_PI, 10.0f);
    int32_t dl_mm = Odom_ScaleFloatRounded(odom_log_delta_left_m, 1000.0f);
    int32_t dr_mm = Odom_ScaleFloatRounded(odom_log_delta_right_m, 1000.0f);

    (void)now_ms;

    APP_LOG("[ODOM] x=%s%lu.%03lu y=%s%lu.%03lu th=%s%lu.%01ludeg dl=%s%lu.%03lu dr=%s%lu.%03lu",
            Odom_FixedSign(x_mm),
            (unsigned long)Odom_FixedWhole(x_mm, 1000),
            (unsigned long)Odom_FixedFraction(x_mm, 1000),
            Odom_FixedSign(y_mm),
            (unsigned long)Odom_FixedWhole(y_mm, 1000),
            (unsigned long)Odom_FixedFraction(y_mm, 1000),
            Odom_FixedSign(theta_tenth_deg),
            (unsigned long)Odom_FixedWhole(theta_tenth_deg, 10),
            (unsigned long)Odom_FixedFraction(theta_tenth_deg, 10),
            Odom_FixedSign(dl_mm),
            (unsigned long)Odom_FixedWhole(dl_mm, 1000),
            (unsigned long)Odom_FixedFraction(dl_mm, 1000),
            Odom_FixedSign(dr_mm),
            (unsigned long)Odom_FixedWhole(dr_mm, 1000),
            (unsigned long)Odom_FixedFraction(dr_mm, 1000));
}
